#+title: Tips for Doom

* ESS
When you update R version, ESS may not pick the newest verion of your R. Try to update the =env= in terminal

#+begin_example
doom env
#+end_example

To check if Emacs finds your R executable file, run in Emacs:

#+begin_src emacs-lisp :tangle yes
(executable-find "R")
#+end_src

#+RESULTS:
: c:/Program Files/R/R-4.5.1/bin/x64/R.exe

If it returns nil, Emacs can't find R in its exec-path. You can fix this by adding the R binary directory to exec-path:

#+begin_example
(add-to-list 'exec-path "/usr/local/bin")
#+end_example
